# ============================================================================
# Taps
# ============================================================================
tap "homebrew/bundle"

# ============================================================================
# System Utilities
# ============================================================================
brew "mas"                 # Mac App Store command line interface
brew "telnet"              # User interface to the TELNET protocol
brew "stow"                # Symlink farm manager

# ============================================================================
# Shell & Terminal Tools
# ============================================================================
brew "powerlevel10k"       # Theme for Zsh
brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
brew "fzf"                 # Command-line fuzzy finder
brew "bat"                 # Cat clone with syntax highlighting
brew "tree"                # Display directories as trees
brew "eza"                 # Modern replacement for ls
brew "zoxide"              # Modern replacement for cd
brew "fd"                  # Simple, fast and user-friendly alternative to find
brew "ripgrep"             # Fast grep alternative
brew "htop"                # Improved top (interactive process viewer)
brew "jq"                  # Lightweight and flexible command-line JSON processor

# ============================================================================
# Version Control & Development Tools
# ============================================================================
brew "git"                 # Version control system
brew "gh"                  # GitHub CLI
brew "act"                 # Run GitHub Actions locally
brew "pre-commit"          # Git pre-commit hook framework
brew "neovim"              # Vim-fork focused on extensibility and usability
brew "asdf"                # Multiple runtime version manager
brew "aider"               # AI pair programming tool
brew "mods"                # AI CLI tools
brew "hurl"                # HTTP testing and debugging
brew "jira-cli"            # Jira command-line interface

# ============================================================================
# Go Development
# ============================================================================
brew "go"                  # Open source programming language
brew "golangci-lint"       # Go linters aggregator
brew "mockery"             # Mock code autogenerator for Go

# ============================================================================
# gRPC & Protocol Buffers
# ============================================================================
brew "protobuf"            # Protocol buffers
brew "protoc-gen-go"       # Go plugin for protobuf compiler
brew "protoc-gen-go-grpc"  # Go gRPC plugin for protobuf compiler
brew "grpcurl"             # Command-line tool for interacting with gRPC servers

# ============================================================================
# Kubernetes Tools
# ============================================================================
brew "kubernetes-cli"      # Kubernetes command-line interface
brew "kubectx"             # Tool for switching between k8s contexts
brew "k9s"                 # Terminal UI to interact with Kubernetes
brew "minikube"            # Run a Kubernetes cluster locally
brew "helm"                # Kubernetes package manager
brew "kustomize"           # Template-free customization of Kubernetes YAML manifests
brew "kubeseal"            # Kubernetes controller and tool for sealed secrets
cask "openlens"            # Kubernetes IDE


# ============================================================================
# Databases
# ============================================================================
brew "mongosh"             # MongoDB Shell
brew "redis"               # Persistent key-value database
brew "mysql"               # Open source relational database management system
brew "postgresql"          # Object-relational database system

# ============================================================================
# Applications
# ============================================================================

# ----------------------------------------------------------------------------
# Terminals
# ----------------------------------------------------------------------------
cask "warp"                          # Rust-based terminal
cask "ghostty"                       # Fast terminal emulator

# ----------------------------------------------------------------------------
# Browsers
# ----------------------------------------------------------------------------
cask "arc"                           # Web browser

# ----------------------------------------------------------------------------
# Development Tools & IDEs
# ----------------------------------------------------------------------------
cask "visual-studio-code"            # VS Code
cask "zed"                           # High-performance, multiplayer code editor
cask "jetbrains-toolbox"             # JetBrains tools manager
cask "postman"                       # API development environment
cask "mongodb-compass"               # MongoDB GUI
# cask "docker"                      # App to build and share containerized applications

# ----------------------------------------------------------------------------
# AI Tools
# ----------------------------------------------------------------------------
cask "claude"                        # Claude AI assistant
cask "claude-code"                   # Claude Code
cask "superwhisper"                  # AI voice input
cask "deepl"                         # AI translator

# ----------------------------------------------------------------------------
# Productivity
# ----------------------------------------------------------------------------
cask "raycast"                       # Control your tools with a few keystrokes
cask "obsidian"                      # Knowledge base that works on local Markdown files
cask "syncthing-app"                     # Open source continuous file synchronization
cask "1password-cli"                 # 1Password command-line interface
cask "1password"                   # Password manager

# ----------------------------------------------------------------------------
# Communication
# ----------------------------------------------------------------------------
cask "telegram"                      # Messaging app with a focus on speed and security
# cask "slack"                       # Team communication and collaboration software
# cask "zoom"                        # Video communication and virtual meeting platform

# ----------------------------------------------------------------------------
# Entertainment
# ----------------------------------------------------------------------------
cask "spotify"                       # Music streaming service

# ----------------------------------------------------------------------------
# System Utilities
# ----------------------------------------------------------------------------
cask "bartender"                     # Menu bar icon organizer
cask "jordanbaird-ice"               # Bartender alternative
cask "aldente"                       # macOS battery saver
cask "pearcleaner"                   # Cleaner for macOS
cask "lunar"                         # Brightness control for macOS
cask "brisync"                       # Brightness control for external displays
cask "wifiman"                       # Ubiquiti WiFi manager

# ----------------------------------------------------------------------------
# Fonts
# ----------------------------------------------------------------------------
cask "font-hack-nerd-font"           # Font with programming ligatures and icons
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font
