# Taps
tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
# tap "homebrew/services"

# Command line utilities
brew "mas"                 # Mac App Store command line interface
brew "telnet"              # User interface to the TELNET protocol
brew "git"                 # Version control system
brew "jq"                  # Lightweight and flexible command-line JSON processor
brew "htop"                # Improved top (interactive process viewer)
brew "bat"                 # Cat clone with syntax highlighting
brew "tree"                # ctories as trees
brew "powerlevel10k"       # Theme for Zsh
brew "neovim"              # Vim-fork focused on extensibility and usability
brew "go"                  # Open source programming language
brew "golangci-lint"       # Go linters aggregator
brew "protobuf"            # Protocol buffers
brew "grpcurl"             # Command-line tool for interacting with gRPC servers
brew "kubernetes-cli"      # Kubernetes command-line interface
brew "kubectx"             # Tool for switching between k8s contexts
brew "k9s"                 # Terminal UI to interact with Kubernetes
brew "minikube"            # Run a Kubernetes cluster locally
brew "helm"                # Kubernetes package manager
brew "mongosh"             # MongoDB Shell
brew "redis"               # Persistent key-value database
brew "mysql"               # Open source relational database management system
brew "postgresql"          # Object-relational database system
brew "tfenv"               # Terraform version manager
brew "kustomize"           # Template-free customization of Kubernetes YAML manifests
brew "kubeseal"            # Kubernetes controller and tool for sealed secrets
brew "mockery"             # Mock code autogenerator for Go
brew "aider"               # AI pair programming tool
brew "fish"                # User-friendly command-line shell
brew "fisher"              # Plugin manager for Fish
brew "starship"            # Cross-shell prompt
brew "fzf"                 # Command-line fuzzy finder
brew "fd"                  # Simple, fast and user-friendly alternative to find
brew "eza"                 # Modern replacement for ls
brew "zoxide"              # Modern replacement for cd
brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
brew "stow"                # Symlink farm manager
brew "jira-cli"            # Jira command-line interface

# Applications
cask "1password-cli"        # 1Password command-line interface
cask "bartender"            # Menu bar icon organizer
cask "deepl"                # AI translator
cask "mongodb-compass"      # MongoDB GUI
cask "warp"                 # Rust-based terminal
cask "arc"                  # Web browser
cask "raycast"              # Control your tools with a few keystrokes
# cask "1password"          # Password manager
# cask "zoom"               # Video communication and virtual meeting platform
cask "spotify"              # Music streaming service
# cask "slack"              # Team communication and collaboration software
cask "postman"              # API development environment
cask "telegram"             # Messaging app with a focus on speed and security
cask "jetbrains-toolbox"    # JetBrains tools manager
# cask "docker"             # App to build and share containerized applications
cask "openlens"             # Kubernetes IDE
cask "zed"                  # High-performance, multiplayer code editor
cask "obsidian"             # Knowledge base that works on local Markdown files
cask "font-hack-nerd-font"  # Font with programming ligatures and icons
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font
cask "ghostty"              # Fast terminal emulator
cask "syncthing"            # Open source continuous file synchronization
cask "visual-studio-code"   # VS Code
cask "superwhisper"         # AI voice input
